<a href="https://colab.research.google.com/github/EstebanPerez25/ActividadFormativaM2-Equipo5/blob/main/M2_1_DavidAcuna_A00571187_ipybn.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Actividad M2.1 Uso de Google Colab


David Alejandro Acuña Orozco

### Lectura de Datos

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
import pandas as pd
df = pd.read_csv("/content/drive/MyDrive/TC2004B.301/titanic.csv")

### Descripción de Variables

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# Obtener los tipos de variables en el dataset
tipos_variables = df.dtypes

# Separar las variables categóricas y numéricas
variables_categoricas = tipos_variables[tipos_variables == 'object'].index.tolist()
variables_numericas = tipos_variables[tipos_variables != 'object'].index.tolist()

In [5]:
print("Variables categóricas:")
print(variables_categoricas)

Variables categóricas:
['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [6]:
print("\nVariables numéricas:")
print(variables_numericas)

Variables numéricas:
['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [7]:
# Obtener los nombres de las columnas
columnas = df.columns
print("Nombres de las columnas:")
print(columnas)

Nombres de las columnas:
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [9]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

> columns(): Esta función devuelve una lista con los nombres de las columnas 
del dataframe. Es útil para obtener un rápido vistazo a la estructura del dataframe y para acceder a columnas específicas mediante su nombre.

>. 

> info(): La función info() proporciona un resumen conciso del dataframe. Muestra información sobre el índice, el número de columnas, los nombres de las columnas, el número de entradas no nulas en cada columna y el tipo de datos de cada columna. Esta función es útil para obtener una descripción general de los datos y verificar si hay valores faltantes en el dataframe.

> .

> describe(): La función describe() calcula estadísticas descriptivas de las columnas numéricas del dataframe. Proporciona información como el recuento (número de valores no nulos), la media, la desviación estándar, los valores mínimo y máximo, y los percentiles (25%, 50%, y 75%). Esta función es útil para obtener una visión general de la distribución y el rango de los valores numéricos en el dataframe.

In [11]:
# Número total de registros
total_registros = len(df)
print("Total de registros:", total_registros)

Total de registros: 891

In [12]:
# Registros con valores nulos
registros_nulos = df[df.isnull().any(axis=1)]
print("Registros con valores nulos:")
print(registros_nulos)

Registros con valores nulos:
     PassengerId  Survived  Pclass                                      Name  \
0              1         0       3                   Braund, Mr. Owen Harris
2              3         1       3                    Heikkinen, Miss. Laina
4              5         0       3                  Allen, Mr. William Henry
5              6         0       3                          Moran, Mr. James
7              8         0       3            Palsson, Master. Gosta Leonard
..           ...       ...     ...                                       ...
884          885         0       3                    Sutehall, Mr. Henry Jr
885          886         0       3      Rice, Mrs. William (Margaret Norton)
886          887         0       2                     Montvila, Rev. Juozas
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0      male  22.0      1      0         A/5 21171   7.2500   NaN        S
2    female  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S
4      male  35.0      0      0            373450   8.0500   NaN        S
5      male   NaN      0      0            330877   8.4583   NaN        Q
7      male   2.0      3      1            349909  21.0750   NaN        S
..      ...   ...    ...    ...               ...      ...   ...      ...
884    male  25.0      0      0   SOTON/OQ 392076   7.0500   NaN        S
885  female  39.0      0      5            382652  29.1250   NaN        Q
886    male  27.0      0      0            211536  13.0000   NaN        S
888  female   NaN      1      2        W./C. 6607  23.4500   NaN        S
890    male  32.0      0      0            370376   7.7500   NaN        Q

[708 rows x 12 columns]

In [13]:
# Registros sin valores nulos
registros_sin_nulos = df.dropna()
print("Registros sin valores nulos:")
print(registros_sin_nulos)

Registros sin valores nulos:
     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
6              7         0       1
10            11         1       3
11            12         1       1
..           ...       ...     ...
871          872         1       1
872          873         0       1
879          880         1       1
887          888         1       1
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                              McCarthy, Mr. Timothy J    male  54.0      0
10                     Sandstrom, Miss. Marguerite Rut  female   4.0      1
11                            Bonnell, Miss. Elizabeth  female  58.0      0
..                                                 ...     ...   ...    ...
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
872                           Carlsson, Mr. Frans Olof    male  33.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch    Ticket     Fare        Cabin Embarked
1        0  PC 17599  71.2833          C85        C
3        0    113803  53.1000         C123        S
6        0     17463  51.8625          E46        S
10       1   PP 9549  16.7000           G6        S
11       0    113783  26.5500         C103        S
..     ...       ...      ...          ...      ...
871      1     11751  52.5542          D35        S
872      0       695   5.0000  B51 B53 B55        S
879      1     11767  83.1583          C50        C
887      0    112053  30.0000          B42        S
889      0    111369  30.0000         C148        C

[183 rows x 12 columns]

In [16]:
# Obtener estadísticas descriptivas de las columnas numéricas
estadisticas = df.describe()

# Tarifa más cara
tarifa_mas_cara = estadisticas.loc["max", "Fare"]
print("Tarifa más cara:", tarifa_mas_cara)

Tarifa más cara: 512.3292

In [17]:
# Promedio de edad
promedio_edad = estadisticas.loc["mean", "Age"]
print("Promedio de edad:", promedio_edad)

Promedio de edad: 29.69911764705882

In [20]:
# Obtener las columnas categóricas
columnas_categoricas = df.select_dtypes(include=["object"]).columns
print(columnas_categoricas)

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [19]:
# Contar los valores únicos en cada columna categórica
for columna in columnas_categoricas:
    valores_unicos = df[columna].unique()
    cantidad_valores_unicos = len(valores_unicos)
    print(f"Número de valores únicos en la columna {columna}: {cantidad_valores_unicos}")

Número de valores únicos en la columna Name: 891
Número de valores únicos en la columna Sex: 2
Número de valores únicos en la columna Ticket: 681
Número de valores únicos en la columna Cabin: 148
Número de valores únicos en la columna Embarked: 4

### Análisis de Datos

In [21]:
# Calcular el total pagado por todos los pasajeros
total_pagado = df["Fare"].sum()
print("Total pagado por todos los pasajeros:", total_pagado)

Total pagado por todos los pasajeros: 28693.9493

In [24]:
# Subconjunto de los pasajeros que sobrevivieron
sobrevivieron = df[df["Survived"] == 1]
num_sobrevivieron = len(sobrevivieron)
print("Número de pasajeros que sobrevivieron:", num_sobrevivieron)

Número de pasajeros que sobrevivieron: 342

In [26]:
datos_sobrevivieron = sobrevivieron.head(5)
print("Datos de las personas que sobrevivieron:")
print(datos_sobrevivieron)

Datos de las personas que sobrevivieron:
   PassengerId  Survived  Pclass  \
1            2         1       1
2            3         1       3
3            4         1       1
8            9         1       3
9           10         1       2

                                                Name     Sex   Age  SibSp  \
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1

   Parch            Ticket     Fare Cabin Embarked
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
8      2            347742  11.1333   NaN        S
9      0            237736  30.0708   NaN        C

In [25]:
# Subconjunto de los pasajeros que no sobrevivieron
no_sobrevivieron = df[df["Survived"] == 0]
num_no_sobrevivieron = len(no_sobrevivieron)
print("Número de pasajeros que no sobrevivieron:", num_no_sobrevivieron)

Número de pasajeros que no sobrevivieron: 549

In [27]:
no_sobrevivieron = df[df["Survived"] == 0]
datos_no_sobrevivieron = no_sobrevivieron.head(5)
print("\nDatos de las personas que no sobrevivieron:")
print(datos_no_sobrevivieron)

Datos de las personas que no sobrevivieron:
   PassengerId  Survived  Pclass                            Name   Sex   Age  \
0            1         0       3         Braund, Mr. Owen Harris  male  22.0
4            5         0       3        Allen, Mr. William Henry  male  35.0
5            6         0       3                Moran, Mr. James  male   NaN
6            7         0       1         McCarthy, Mr. Timothy J  male  54.0
7            8         0       3  Palsson, Master. Gosta Leonard  male   2.0

   SibSp  Parch     Ticket     Fare Cabin Embarked
0      1      0  A/5 21171   7.2500   NaN        S
4      0      0     373450   8.0500   NaN        S
5      0      0     330877   8.4583   NaN        Q
6      0      0      17463  51.8625   E46        S
7      3      1     349909  21.0750   NaN        S